{"config": [{"config": {"nb_row": 3, "border_mode": "same", "b_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "activation": "relu", "batch_input_shape": [null, 32, 16, 1], "name": "convolution2d_1", "activity_regularizer": null, "bias": true, "input_dtype": "float32", "subsample": [1, 1], "W_regularizer": null, "trainable": true, "nb_col": 3, "W_constraint": null, "init": "glorot_uniform", "nb_filter": 32}, "class_name": "Convolution2D"}, {"config": {"nb_row": 3, "border_mode": "valid", "b_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "activation": "relu", "name": "convolution2d_2", "activity_regularizer": null, "bias": true, "subsample": [1, 2], "W_regularizer": null, "trainable": true, "nb_col": 3, "W_constraint": null, "init": "glorot_uniform", "nb_filter": 24}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"nb_row": 3, "border_mode": "valid", "b_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "activation": "relu", "name": "convolution2d_3", "activity_regularizer": null, "bias": true, "subsample": [1, 1], "W_regularizer": null, "trainable": true, "nb_col": 3, "W_constraint": null, "init": "glorot_uniform", "nb_filter": 36}, "class_name": "Convolution2D"}, {"config": {"nb_row": 2, "border_mode": "valid", "b_regularizer": null, "dim_ordering": "tf", "b_constraint": null, "activation": "relu", "name": "convolution2d_4", "activity_regularizer": null, "bias": true, "subsample": [1, 1], "W_regularizer": null, "trainable": true, "nb_col": 2, "W_constraint": null, "init": "glorot_uniform", "nb_filter": 48}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"output_dim": 512, "b_regularizer": null, "b_constraint": null, "activation": "linear", "name": "dense_1", "activity_regularizer": null, "bias": true, "W_regularizer": null, "trainable": true, "input_dim": null, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"output_dim": 10, "b_regularizer": null, "b_constraint": null, "activation": "linear", "name": "dense_2", "activity_regularizer": null, "bias": true, "W_regularizer": null, "trainable": true, "input_dim": null, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"output_dim": 1, "b_regularizer": null, "b_constraint": null, "activation": "tanh", "name": "output", "activity_regularizer": null, "bias": true, "W_regularizer": null, "trainable": true, "input_dim": null, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.1"}